In [14]:
import pandas as pd

In [15]:
people = {
    "first": ["Al", "Bhosdu", "Babblu", "Anda"], 
    "last": ["Singh", "Lullu", "Lullu", "Lullu"],
    "email": ["as@gmal.com", "bl@email.com", "bs@email.com", "alulli@gmail.com"]
}

In [16]:
sample_df = pd.DataFrame(people)

In [17]:
sample_df

    first   last             email
0      Al  Singh       as@gmal.com
1  Bhosdu  Lullu      bl@email.com
2  Babblu  Lullu      bs@email.com
3    Anda  Lullu  alulli@gmail.com

In [18]:
sample_df.sort_values(by="last", ascending=False)

    first   last             email
0      Al  Singh       as@gmal.com
1  Bhosdu  Lullu      bl@email.com
2  Babblu  Lullu      bs@email.com
3    Anda  Lullu  alulli@gmail.com

In [19]:
sample_df.sort_values(by=["last", "first"], ascending=False)

    first   last             email
0      Al  Singh       as@gmal.com
1  Bhosdu  Lullu      bl@email.com
2  Babblu  Lullu      bs@email.com
3    Anda  Lullu  alulli@gmail.com

In [21]:
sample_df.sort_values(by=["last", "first"], ascending=[False, True], inplace=True)

In [22]:
sample_df

    first   last             email
0      Al  Singh       as@gmal.com
3    Anda  Lullu  alulli@gmail.com
2  Babblu  Lullu      bs@email.com
1  Bhosdu  Lullu      bl@email.com